Repository: resc863/MangaViewer
Catalog: MangaViewer/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, ko_kr

# ThumbnailPaneToggle.ToolTipService.ToolTip
source: Thumbnail pane
ja_jp: サムネイルパネル
ko_kr: 썸네일 패널

# BookmarkPaneToggle.ToolTipService.ToolTip
source: Bookmark pane
ja_jp: ブックマークパネル
ko_kr: 북마크 패널

# AddBookmarkButton.Label
source: Add bookmark
ja_jp: ブックマーク追加
ko_kr: 북마크 추가

# OpenFolderButton.Label
source: Open folder
ja_jp: フォルダーを開く
ko_kr: 폴더 열기

# TranslationToggle.Label
source: Translation
ja_jp: 翻訳
ko_kr: 번역

# NavLibraryItem.Content
source: Library
ja_jp: ライブラリ
ko_kr: 라이브러리

# NavReaderItem.Content
source: Reader
ja_jp: リーダー
ko_kr: 리더

# NavSearchItem.Content
source: Search
ja_jp: 検索
ko_kr: 검색

# RemoveBookmarkButton.Content
source: Remove
ja_jp: 削除
ko_kr: 제거

# SingleOcrTextBox.PlaceholderText
source: OCR text
ja_jp: OCRテキスト
ko_kr: OCR 텍스트

# SingleTranslationTextBox.PlaceholderText
source: Translation
ja_jp: 翻訳結果
ko_kr: 번역 결과

# LeftOcrTextBox.PlaceholderText
source: Left OCR text
ja_jp: 左OCRテキスト
ko_kr: 왼쪽 OCR 텍스트

# LeftTranslationTextBox.PlaceholderText
source: Left translation
ja_jp: 左翻訳
ko_kr: 왼쪽 번역

# RightOcrTextBox.PlaceholderText
source: Right OCR text
ja_jp: 右OCRテキスト
ko_kr: 오른쪽 OCR 텍스트

# RightTranslationTextBox.PlaceholderText
source: Right translation
ja_jp: 右翻訳
ko_kr: 오른쪽 번역

# LibraryHeaderTitle.Text
source: Manga Library
ja_jp: マンガライブラリ
ko_kr: 만화 라이브러리

# LibraryRefreshButton.Content
source: Refresh
ja_jp: 更新
ko_kr: 새로고침

# LibraryEmptyTitle.Text
source: No library folders
ja_jp: ライブラリフォルダーがありません
ko_kr: 라이브러리 폴더가 없습니다

# LibraryEmptyDescription.Text
source: Add manga library folders in Settings
ja_jp: 設定でマンガライブラリフォルダーを追加してください
ko_kr: 설정에서 만화 라이브러리 폴더를 추가하세요

# QueryBox.PlaceholderText
source: Enter search query
ja_jp: 検索語を入力
ko_kr: 검색어 입력

# SearchButton.Content
source: Search
ja_jp: 検索
ko_kr: 검색

# OpenMenuItem.Text
source: Open
ja_jp: 開く
ko_kr: 불러오기

# DetailsMenuItem.Text
source: Details
ja_jp: 詳細
ko_kr: 상세 정보

# ArtistItem.Text
source: Artist
ja_jp: 作者
ko_kr: 작가

# GroupItem.Text
source: Group
ja_jp: グループ
ko_kr: 그룹

# TagsRoot.Text
source: Tags
ja_jp: タグ
ko_kr: 태그

# OpenLinkButton.Content
source: Open source
ja_jp: 元ページを開く
ko_kr: 원본 열기

# LanguageHeader.Text
source: Language
ja_jp: 言語
ko_kr: 언어

# ArtistsHeader.Text
source: Artist
ja_jp: 作者
ko_kr: 작가

# GroupsHeader.Text
source: Group
ja_jp: グループ
ko_kr: 그룹

# ParodiesHeader.Text
source: Parody
ja_jp: パロディ
ko_kr: 패러디

# MaleTagHeader.Text
source: Male tags
ja_jp: Maleタグ
ko_kr: Male 태그

# FemaleTagHeader.Text
source: Female tags
ja_jp: Femaleタグ
ko_kr: Female 태그

# OtherTagHeader.Text
source: Other tags
ja_jp: その他タグ
ko_kr: 기타 태그

# Reader.Direction.Reverse
source: Reading direction: RTL
ja_jp: 読み方向: 右から左
ko_kr: 읽기 방향: 역방향

# Reader.Direction.Forward
source: Reading direction: LTR
ja_jp: 読み方向: 左から右
ko_kr: 읽기 방향: 정방향

# Reader.Cover.Single
source: Cover: single page
ja_jp: 表紙: 1ページ表示
ko_kr: 표지: 한 장으로 보기

# Reader.Cover.Double
source: Cover: two pages
ja_jp: 表紙: 2ページ表示
ko_kr: 표지: 두 장으로 보기

# Settings.General.Header
source: App settings
ja_jp: アプリ設定
ko_kr: 앱 설정

# Settings.AppLanguage.Label
source: UI language:
ja_jp: UI言語:
ko_kr: UI 언어:

# Settings.AppLanguage.Auto
source: System default
ja_jp: システム既定
ko_kr: 시스템 기본값

# Settings.AppLanguage.Korean
source: Korean
ja_jp: 韓国語
ko_kr: 한국어

# Settings.AppLanguage.English
source: English
ja_jp: 英語
ko_kr: 영어

# Settings.AppLanguage.Japanese
source: Japanese
ja_jp: 日本語
ko_kr: 일본어

# Settings.AppLanguage.Restart.Title
source: Language changed
ja_jp: 言語変更
ko_kr: 언어 변경

# Settings.AppLanguage.Restart.Message
source: Restart the app to fully apply all UI text changes.
ja_jp: すべてのUIテキストを完全に反映するにはアプリを再起動してください。
ko_kr: 일부 UI는 앱을 다시 시작하면 완전히 적용됩니다.

# Settings.Common.Remove
source: Remove
ja_jp: 削除
ko_kr: 제거

# Settings.Common.Delete
source: Delete
ja_jp: 削除
ko_kr: 삭제

# Settings.Common.Use
source: Use
ja_jp: 使用
ko_kr: 사용

# Settings.Common.NotUse
source: Do not use
ja_jp: 未使用
ko_kr: 사용 안 함

# Settings.Common.Auto
source: Auto
ja_jp: 自動
ko_kr: 자동

# Settings.Common.Manual
source: Manual
ja_jp: 手動
ko_kr: 수동

# Settings.Common.Off
source: Off
ja_jp: オフ
ko_kr: 꺼짐

# Settings.Common.On
source: On
ja_jp: オン
ko_kr: 켜짐

# Settings.Common.Enabled
source: Enabled
ja_jp: 有効
ko_kr: 활성화

# Settings.Common.Disabled
source: Disabled
ja_jp: 無効
ko_kr: 비활성화

# Settings.Common.Apply
source: Apply
ja_jp: 適用
ko_kr: 적용

# Settings.Common.Refresh
source: Refresh
ja_jp: 更新
ko_kr: 새로고침

# Settings.Common.Loading
source: Loading...
ja_jp: 読み込み中...
ko_kr: 가져오는 중...

# Settings.Common.ErrorPrefix
source: Error:
ja_jp: エラー:
ko_kr: 오류:

# Settings.Common.FailedPrefix
source: Failed:
ja_jp: 失敗:
ko_kr: 실패:

# Settings.Common.Downloading
source: Downloading...
ja_jp: ダウンロード中...
ko_kr: 다운로드 중...

# Settings.Common.DownloadFailedPrefix
source: Download failed:
ja_jp: ダウンロード失敗:
ko_kr: 다운로드 실패:

# Settings.Common.Enumerating
source: Enumerating...
ja_jp: 列挙中...
ko_kr: 열거 중...

# Settings.Common.None
source: (none)
ja_jp: (なし)
ko_kr: (없음)

# Settings.Common.Registering
source: Registering...
ja_jp: 登録中...
ko_kr: 등록 중...

# Settings.Common.Ok
source: OK
ko_kr: 확인

# Settings.Library.Header
source: Manga library
ja_jp: マンガライブラリ
ko_kr: 만화 라이브러리

# Settings.Library.AddFolder
source: Add library folder
ja_jp: ライブラリフォルダー追加
ko_kr: 라이브러리 폴더 추가

# Settings.Ocr.Header
source: OCR settings
ja_jp: OCR設定
ko_kr: OCR 설정

# Settings.Ocr.Engine
source: OCR engine:
ja_jp: OCRエンジン:
ko_kr: OCR 엔진:

# Settings.Ocr.OllamaEndpoint
source: Ollama endpoint:
ja_jp: Ollamaエンドポイント:
ko_kr: Ollama 주소:

# Settings.Ocr.LoadModels
source: Load models
ja_jp: モデル読み込み
ko_kr: 모델 불러오기

# Settings.Ocr.Model
source: OCR model:
ja_jp: OCRモデル:
ko_kr: OCR 모델:

# Settings.Ocr.Output.Json
source: JSON (with boxes)
ja_jp: JSON（ボックス含む）
ko_kr: JSON(박스 포함)

# Settings.Ocr.Output.Text
source: Plain text
ja_jp: テキスト
ko_kr: 일반 텍스트

# Settings.Ocr.OutputFormat
source: Output format:
ja_jp: 出力形式:
ko_kr: 출력 형식:

# Settings.Ocr.HybridParallel
source: Hybrid text parallel:
ko_kr: 하이브리드 텍스트 병렬:

# Settings.Ocr.HybridFallback
source: Hybrid fallback to VLM:
ja_jp: Hybrid VLMフォールバック:
ko_kr: 하이브리드 VLM 폴백:

# Settings.Ocr.DocLayout.Download
source: Download PP-DocLayoutV3 model
ja_jp: PP-DocLayoutV3モデルをダウンロード
ko_kr: PP-DocLayoutV3 모델 다운로드

# Settings.Ocr.DocLayout.Model
source: DocLayout model:
ja_jp: DocLayoutモデル:
ko_kr: DocLayout 모델:

# Settings.Ocr.DocLayout.InstalledWithEp
source: Installed + EP context ready
ja_jp: インストール済み + EPコンテキスト準備完了
ko_kr: 설치됨 + EP 컨텍스트 준비됨

# Settings.Ocr.DocLayout.Installed
source: Installed
ja_jp: インストール済み
ko_kr: 설치됨

# Settings.Ocr.DocLayout.NotInstalled
source: Not installed (required for Hybrid OCR).
ja_jp: 未インストール（Hybrid OCRに必要）
ko_kr: 설치되지 않음 (Hybrid OCR 필수).

# Settings.Ocr.OnnxEpMode
source: ONNX EP mode:
ja_jp: ONNX EPモード:
ko_kr: ONNX EP 모드:

# Settings.Ocr.ManualEpList
source: Manual EP list:
ja_jp: 手動EPリスト:
ko_kr: 수동 EP 목록:

# Settings.Ocr.EpRegisterNow
source: EP register now
ja_jp: EPを今すぐ登録
ko_kr: EP 즉시 등록

# Settings.Ocr.GetCompatibleEps
source: Get compatible EPs
ja_jp: 互換EPを取得
ko_kr: 호환 EP 조회

# Settings.Ocr.ExecutionProvider
source: Execution provider:
ja_jp: 実行プロバイダー:
ko_kr: 실행 공급자:

# Settings.Ocr.CompatibleEps
source: Compatible EPs:
ja_jp: 互換EP:
ko_kr: 호환 EP:

# Settings.Ocr.Status.CudaGraphUpdated
source: TensorRT RTX CUDA graph option updated
ja_jp: TensorRT RTX CUDA graphオプションを更新しました
ko_kr: TensorRT RTX CUDA graph 옵션이 업데이트되었습니다

# Settings.Ocr.TensorRtRuntimeCache
source: TensorRT RTX runtime cache:
ja_jp: TensorRT RTXランタイムキャッシュ:
ko_kr: TensorRT RTX 런타임 캐시:

# Settings.Ocr.UseCompiledModel
source: Use compiled model
ja_jp: コンパイル済みモデルを使用
ko_kr: 컴파일 모델 사용

# Settings.Ocr.UseSourceOnnx
source: Use source ONNX
ja_jp: ソースONNXを使用
ko_kr: 원본 ONNX 사용

# Settings.Ocr.Status.EpContextEnabled
source: EP context loading enabled
ja_jp: EPコンテキスト読込を有効化
ko_kr: EP 컨텍스트 로드 활성화

# Settings.Ocr.Status.EpContextDisabled
source: EP context loading disabled
ja_jp: EPコンテキスト読込を無効化
ko_kr: EP 컨텍스트 로드 비활성화

# Settings.Ocr.EpContextLoad
source: EP context load:
ja_jp: EPコンテキスト読込:
ko_kr: EP 컨텍스트 로드:

# Settings.Ocr.AutoCompile
source: Auto compile
ja_jp: 自動コンパイル
ko_kr: 자동 컴파일

# Settings.Ocr.ManualCompile
source: Manual compile
ja_jp: 手動コンパイル
ko_kr: 수동 컴파일

# Settings.Ocr.Status.EpAutoCompileEnabled
source: EP context auto compile enabled
ja_jp: EPコンテキスト自動コンパイル有効
ko_kr: EP 컨텍스트 자동 컴파일 활성화

# Settings.Ocr.Status.EpAutoCompileDisabled
source: EP context auto compile disabled
ja_jp: EPコンテキスト自動コンパイル無効
ko_kr: EP 컨텍스트 자동 컴파일 비활성화

# Settings.Ocr.EpContextCompileMode
source: EP context compile mode:
ja_jp: EPコンテキストコンパイルモード:
ko_kr: EP 컨텍스트 컴파일 모드:

# Settings.Ocr.CompileEpContextNow
source: Compile EP context now
ja_jp: EPコンテキストを今すぐコンパイル
ko_kr: EP 컨텍스트 즉시 컴파일

# Settings.Ocr.Status.CompilingEpContext
source: Compiling EP context...
ja_jp: EPコンテキストをコンパイル中...
ko_kr: EP 컨텍스트 컴파일 중...

# Settings.Ocr.EpContextCompile
source: EP context compile:
ja_jp: EPコンテキストコンパイル:
ko_kr: EP 컨텍스트 컴파일:

# Settings.Ocr.Language
source: Language:
ja_jp: 言語:
ko_kr: 언어:

# Settings.Ocr.Group.Word
source: Word
ja_jp: 単語
ko_kr: 단어

# Settings.Ocr.Group.Line
source: Line
ja_jp: 行
ko_kr: 줄

# Settings.Ocr.Group.Paragraph
source: Paragraph
ja_jp: 段落
ko_kr: 문단

# Settings.Ocr.Group.Label
source: Group:
ja_jp: グループ:
ko_kr: 그룹:

# Settings.Ocr.Writing.Horizontal
source: Horizontal
ja_jp: 横書き
ko_kr: 가로

# Settings.Ocr.Writing.Vertical
source: Vertical
ja_jp: 縦書き
ko_kr: 세로

# Settings.Ocr.Writing.Label
source: Writing mode:
ja_jp: 文字方向:
ko_kr: 텍스트 방향:

# Settings.Ocr.AdjacentCache
source: Adjacent page OCR cache:
ja_jp: 隣接ページOCRキャッシュ:
ko_kr: 인접 페이지 OCR 캐시:

# Settings.Ocr.AdjacentCount
source: OCR adjacent page count:
ja_jp: OCR隣接ページ数:
ko_kr: OCR 인접 페이지 수:

# Settings.Ocr.Thinking.Supported
source: Selected model: Thinking supported
ja_jp: 選択モデル: Thinking対応
ko_kr: 선택 모델: Thinking 지원

# Settings.Ocr.Thinking.NotSupported
source: Selected model: Thinking not supported
ja_jp: 選択モデル: Thinking非対応
ko_kr: 선택 모델: Thinking 미지원

# Settings.Ocr.LoadingModels
source: Loading models...
ja_jp: モデル取得中...
ko_kr: 모델 조회 중...

# Settings.Ocr.ModelsCountVisionTool
source: {0} (Vision+Tool)
ko_kr: {0}개 (Vision+Tool)

# Settings.Translation.Header
source: Translation settings
ja_jp: 翻訳設定
ko_kr: 번역 설정

# Settings.Translation.ApiKey
source: API key:
ja_jp: APIキー:
ko_kr: API 키:

# Settings.Translation.TargetLanguage
source: Target language:
ja_jp: 対象言語:
ko_kr: 타겟 언어:

# Settings.Translation.SelectModel
source: Select model
ja_jp: モデルを選択
ko_kr: 모델을 선택하세요

# Settings.Translation.FetchModelList
source: Fetch list
ja_jp: 一覧取得
ko_kr: 목록 가져오기

# Settings.Translation.Model
source: Model:
ja_jp: モデル:
ko_kr: 모델:

# Settings.Translation.SystemPromptPlaceholder
source: System prompt
ja_jp: システムプロンプト
ko_kr: 시스템 프롬프트

# Settings.Thinking.Minimal
source: Minimal
ja_jp: 最小
ko_kr: 최소

# Settings.Thinking.Low
source: Low
ja_jp: 低
ko_kr: 낮음

# Settings.Thinking.Medium
source: Medium
ja_jp: 中
ko_kr: 보통

# Settings.Thinking.High
source: High
ja_jp: 高
ko_kr: 높음

# Settings.Translation.EnterApiKeyFirst
source: Enter API key first
ja_jp: 先にAPIキーを入力してください
ko_kr: API 키를 먼저 입력하세요

# Settings.Translation.Provider
source: Provider:
ja_jp: プロバイダー:
ko_kr: 공급자:

# Settings.Translation.SystemPrompt
source: System prompt:
ja_jp: システムプロンプト:
ko_kr: 시스템 프롬프트:

# Settings.Translation.AdjacentCache
source: Adjacent page translation cache:
ja_jp: 隣接ページ翻訳キャッシュ:
ko_kr: 인접 페이지 번역 캐시:

# Settings.Translation.AdjacentCount
source: Translation adjacent page count:
ja_jp: 翻訳隣接ページ数:
ko_kr: 번역 인접 페이지 수:

# Settings.Translation.OverlayFontSize
source: Translation overlay font size:
ja_jp: 翻訳オーバーレイ文字サイズ:
ko_kr: 번역 바운딩 박스 글자 크기:

# Settings.Translation.OverlayBoxHorizontal
source: Translation overlay width:
ja_jp: 翻訳オーバーレイ横サイズ:
ko_kr: 번역 바운딩 박스 가로 크기:

# Settings.Translation.OverlayBoxVertical
source: Translation overlay height:
ja_jp: 翻訳オーバーレイ縦サイズ:
ko_kr: 번역 바운딩 박스 세로 크기:

# Settings.Tag.Header
source: Tag display
ja_jp: タグ表示
ko_kr: 태그 표시

# Settings.Tag.FontSize
source: Tag font size:
ja_jp: タグ文字サイズ:
ko_kr: 태그 폰트 크기:

# Settings.Thumbnail.Header
source: Thumbnail settings
ja_jp: サムネイル設定
ko_kr: 썸네일 설정

# Settings.Thumbnail.DecodeWidth
source: Decode width (px):
ja_jp: デコード幅(px):
ko_kr: 디코드 폭(px):

# Settings.Cache.Header
source: Image cache
ja_jp: 画像キャッシュ
ko_kr: 이미지 캐시

# Settings.Cache.MaxImageCount
source: Max image count
ja_jp: 最大画像数
ko_kr: 최대 이미지 수

# Settings.Cache.MaxSizeGb
source: Max size (GB)
ja_jp: 最大容量(GB)
ko_kr: 최대 용량(GB)

# Settings.Cache.ClearAll
source: Clear all cache
ja_jp: キャッシュをすべて削除
ko_kr: 캐시 전체 삭제

# Settings.Cache.Summary
source: Total: {0} images, {1:F1} MB
ja_jp: 合計: {0} images, {1:F1} MB
ko_kr: 합계: {0} images, {1:F1} MB
